* Mail in Emacs!
#+BEGIN_SRC shell :results output
echo "mu! mu mu! muuuuuu!" | cowsay
#+END_SRC

#+RESULTS:
:  _____________________
: < mu! mu mu! muuuuuu! >
:  ---------------------
:         \   ^__^
:          \  (oo)\_______
:             (__)\       )\/\
:                 ||----w |
:                 ||     ||

* Index mail

- Index all mail based on muhome
- One email doesn't require separate muhome

#+BEGIN_SRC shell :results output silent
  mu index --muhome=$HOME/.mu/emacsnyc
#+END_SRC

#+RESULTS:
#+begin_example
database-path      : /home/eric/.mu/emacsnyc/xapian
messages in store  : 0
schema-version     : 451
created            : Sun 28 Feb 2021 11:17:34 PM EST
maildir            : /home/eric/.mail/emacsnyc
personal-addresses : emacsnyc@fastmail.com

cleaning up messages [/home/eric/.mu/emacsnyc/xapian]
\ processing mail; processed: 24; updated/new: 0, cleaned-up: 0
elapsed: 0 second(s)
| processing mail; processed: 24; updated/new: 0, cleaned-up: 0
elapsed: 0 second(s)
#+end_example

